{
    "roles": [
        {
            "id": "j1",
            "image": "ba.png",
            "name": "Software Engineer",
            "description": "As a Software Engineer, you're essential in creating and maintaining software. Your skills in coding, problem-solving, and teamwork are key to project success. This guide gives a detailed overview of what's needed for a successful career in Software Engineering",
            "responsibilities":"se responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j2",
            "image": "ca.png",
            "name": "Business analyst",
            "description": "As a Business Analyst, you play a crucial role in helping organizations enhance their operations and achieve strategic objectives. You act as a bridge between business stakeholders and technology teams, translating business needs into actionable insights and solutions.",
            "responsibilities":"ba responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j3",
            "image": "sa.png",
            "name": "Project Manager",
            "description": "A Project Manager oversees project planning and execution, leading teams to achieve organizational goals. With strong organizational and communication skills, they ensure successful project completion. Integral to various industries, Project Managers play a vital role in achieving efficient and impactful outcomes.",
            "responsibilities":"pm responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j4",
            "image": "ds.png",
            "name": "QA Engineer",
            "description": "Embark on a journey as a Quality Assurance (QA) Engineer, contributing to the delivery of high-quality software solutions. QA Engineers ensure software quality, meticulously testing and identifying defects to deliver robust and error-free applications. They collaborate with development teams, utilizing testing tools and automation to safeguard the integrity of software solutions. Essential guardians of quality in the tech landscape.",
            "responsibilities":"qa responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j5",
            "image": "ds.png",
            "name": "Database Administrator",
            "description": "As a Database Administrator (DBA), you play a crucial role in managing and maintaining an organization's databases. Your primary responsibility is to ensure the integrity, security, and performance of the databases, allowing for efficient data storage and retrieval.",
            "responsibilities":"da responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j6",
            "image": "ds.png",
            "name": "DevOps Engineer",
            "description": "Embark on a transformative journey as a DevOps Engineer, playing a pivotal role in bridging the gap between development and operations.DevOps Engineers streamline software delivery, uniting development and operations. They automate processes, manage infrastructure, and ensure collaboration for efficient and reliable deployment. Proficient in scripting, cloud platforms, and CI/CD tools, they are essential contributors to modern software development.",
            "responsibilities":"Devops responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j7",
            "image": "ds.png",
            "name": "Network Engineer",
            "description": "As a Network Engineer, you play a crucial role in designing, implementing, and maintaining the backbone of information flow for businesses.",
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j8",
            "image": "ds.png",
            "name": "Data Scientist",
            "description": "Embark on a data-driven journey as a Data Scientist, unraveling insights and patterns from complex datasets. Data Scientists decode complex data, revealing patterns that drive informed decisions. Proficient in programming and statistics, they communicate insights effectively, playing a vital role in shaping data-driven strategies for business success.",
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j9",
            "image": "ds.png",
            "name": "UI/UX  Designer",
            "description": {
                "steps": [
                    "I.\tResearch",
                    "II.\tInformation Architecture",
                    "III.\tWireframing and Prototyping",
                    "IV.\tVisual Design",
                    "V.\tUsability Testing",
                    "VI.\tCollaboration",
                    "VII.\tResponsive Design",
                    "VIII.\tAccessibility",
                    "IX.\tStay Updated",
                    "X.\tIterative Improvement"
                ]
            },
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j10",
            "image": "ds.png",
            "name": "Software Architect",
            "description": "Software Architects are visionary designers, shaping the blueprint for scalable and innovative software solutions. With a focus on system design, technology selection, and collaboration, they lead in creating robust, efficient, and secure digital landscapes. Combining technical expertise with effective communication, Software Architects drive digital innovation and success.",
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j11",
            "image": "ds.png",
            "name": "Computer Scientist",
            "description": "Computer Scientists are innovative architects, blending research and coding to unravel complex computational challenges. Proficient in diverse languages, they shape the future of technology through algorithmic thinking and collaboration. Each line of code signifies a step towards groundbreaking solutions in the dynamic world of computer science.",
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j12",
            "image": "ds.png",
            "name": "Machine learning Engineer",
            "description": "Machine Learning Engineers craft intelligent systems, designing and deploying algorithms for artificial intelligence solutions. With a blend of programming and data science expertise, they collaborate across teams to bring predictive analytics and automation to the forefront of technology. Embark on a dynamic journey, shaping the future through actionable intelligence.",
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j13",
            "image": "ds.png",
            "name": "IT Consultant",
            "description": "An IT Consultant is a professional who provides expert advice and assistance to organizations in managing and optimizing their information technology (IT) systems. The primary goal is to help businesses use technology effectively to achieve their objectives and improve overall performance.",
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j14",
            "image": "ds.png",
            "name": "Developer",
            "description": {
                "steps": [
                    "I.\tDatabase Developer",
                    "II.\tSoftware Developer",
                    "III.\tMobile App Developer",
                    "IV.\tVideo Game Developer'",
                    "V.\tFull-stack Developer",
                    "VI.\tWeb Developer",
                    "As a developer, you play a crucial role in the creation and maintenance of websites, ensuring they function smoothly and meet the needs of users."
                ]
            },
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        },
        {
            "id": "j15",
            "image": "ds.png",
            "name": "Academic",
            "description": {
                "steps": [
                    "i. Lecturer",
                    "ii. Computer Scientist",
                    "Embark on a dynamic academic journey in Computer Science, shaping the future of computing through teaching, research, and innovation. This role blends teaching excellence, pioneering research, and mentorship, offering a platform to inspire the next generation and contribute to cutting-edge advancements in the field. Explore the guide for insights into the multifaceted responsibilities and skills defining success in this impactful academic role."
                ]
            },
            "responsibilities":"responsibilities",
            "skills":{
                "soft":"soft skills",
                "tech":"tech skills"
            },
            "courses":"courseid list"
        }
    ]
}
